// 1) Ваша функція має приймати одне натуральне число, після чого вивести:
// "Fizz", якщо це число ділиться на 3;
// "Buzz", якщо це число ділиться на 5;
// “FizzBuzz”, якщо виконані обидві попередні умови;
// саме це число в інших випадках
// ===============================
// 2) Побудувати драбинку з чисел.
// Програма приймає на вхід ціле позитивне число n (n<=15) - кількість рівнів, ваше завдання вивести n рівнів,
// у кожному з яких стоять числа від 1 до рівня.
// ===============================
// 3) Напишіть функцію для побудови горизонтальних стовпчастих діаграм за допомогою символу зірочки.
// Вводити потрібно масив з цілими данними



// 1) Ваша функція має приймати одне натуральне число, після чого вивести:
// "Fizz", якщо це число ділиться на 3;
// "Buzz", якщо це число ділиться на 5;
// “FizzBuzz”, якщо виконані обидві попередні умови;
// саме це число в інших випадках ↓
// function check_digit(a)
// {
//     if(a % 3 == 0 && a % 5 == 0)
//         console.log("FizzBuzz");
//     else if(a % 3 == 0)
//         console.log("Fizz");
//     else if(a % 5 == 0)
//         console.log("Buzz");
//     else
//         console.log(a);
// }


// let super_digit  = 15;
// check_digit(super_digit);



// Це саме завдання але з використанням масива ↓
// function check_digits(mas)
// {
//     for(let i=0; i < mas.length; i++)
//     {
//     if(mas[i] % 3 == 0 && mas[i] % 5 == 0)
//         console.log(mas[i],"FizzBuzz");
//     else if(mas[i] % 3 == 0)
//         console.log(mas[i],"Fizz");
//     else if(mas[i] % 5 == 0)
//         console.log(mas[i],"Buzz");
//     else
//         console.log(mas[i]);
//     }
// }

// const super_digits = [3,14,2,19,18,15,25,2];
// check_digits(super_digits);



// 2) Побудувати драбинку з чисел.
// Програма приймає на вхід ціле позитивне число n (n<=15) - кількість рівнів, ваше завдання вивести n рівнів,
// у кожному з яких стоять числа від 1 до рівня ↓
// function digit_stairs(a)
// {
//    for(let i=0; i<a; i++)
//    {
//      console.log;                   ??????
//    }
// }



// 3) Напишіть функцію для побудови горизонтальних стовпчастих діаграм за допомогою символу зірочки.
// Вводити потрібно масив з цілими данними ↓
// function graphic(a)
// {
//    for(let i=0; i<a; i++)
//    {
//       console.log("*");
//    }
//    console.log("------------");
// }

// const digits = [3,7,1,10,8];

// for (let i = 0; i < digits.length; i++)
// { 
//    graphic(digits[i])  
// }