// // ==========================================================================================
// // - 1.Створити масив з будь-якою кількістю елементів різного типу (string, number, boolean) та
// // - 1.1 вивести в консоль лише цифри
// // - 1.2 вивести в консоль лише стрічки, які мають 4 та більше символів.
// // - 1.3 вивести лише булівські значення true
// // ==========================================================================================

// // 1.1 вивести в консоль лише цифри ↓
// const mas = [1,'Hi',3,'Goodbye',5,true,5,8,3,1,false,'Hello World',10]
// let n = mas.length;

// for(let i=0; i < n; i++)
// {
//     if( (typeof mas[i]) == 'number' )
//     {
//         console.log(mas[i]);
//     }
// }



// // 1.2 вивести в консоль лише стрічки, які мають 4 та більше символів ↓
// const mas = [1,'Hi',3,'Goodbye',5,true,5,8,3,1,false,'Hello World',10]
// let n = mas.length;

// for(let i=0; i < n; i++)
// {
//     if( (typeof mas[i]) == 'string' && (mas[i].length) > 4)
//     {
//         console.log(mas[i]);
//     }
// }



// // 1.3 вивести лише булівські значення true ↓
// const mas = [1,'Hi',3,'Goodbye',5,true,5,8,3,1,false,'Hello World',10,true,false,5,7,3]
// let n = mas.length;

// for(let i=0; i < n; i++)
// {
//     if( (typeof mas[i]) == 'boolean' && (mas[i]) == true)
//     {
//         console.log('Boolean with index:', i, 'is', mas[i]);
//     }
// }






// // - 2 Створити масив з 100 ітерацій, та вивести:
// // - 2.1 кожен індекс 
// // - 2.2 тільки парні індекси (2, 4, 6, 8 ...)
// // - 2.3 індекси кратні 3 (3, 9, 12, 15 ...)


// // 2.1 кожен індекс ↓
// const mas = []

// for(let i=0; i < 100; i++)
// {
//     let res = mas.push(i);
//     console.log(mas[i]);
// }



// // 2.2 тільки парні індекси (2, 4, 6, 8 ...) ↓
// const mas = []

// for(let i=0; i < 100; i++)
// {
//     let res = mas.push(i);
    
//     if(i % 2 == 0)
//     {
//         console.log(mas[i]);
//     }
// }



// // 2.3 індекси кратні 3 (3, 9, 12, 15 ...) ↓
// const mas = []

// for(let i=0; i < 100; i++)
// {
//     let res = mas.push(i);
    
//     if(i % 2 != 0)
//     {
//         console.log(mas[i]);
//     }
// }




// // ==========================================================================================
// // - 3.1 Дано масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift()
// // - 3.2 Дано масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop()
// // - 3.3 Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5].
// // - 3.4 Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e'].
// // - 3.5 Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними.
// // - 3.6 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. 
// // За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший
// // - 3.7 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. За допомогою будь-якого циклу скопіювати значення одного масиву в інший.
// // ==========================================================================================



// // 3.1 Дано масив ['js', 'css', 'jq']. Виведіть на екран перший елемент за допомогою shift() ↓
// const mas = ['js', 'css', 'jq'] 
// const n = mas.length;

//     console.log(mas.shift());



// // 3.2 Дано масив ['js', 'css', 'jq']. Виведіть на екран останній елемент за допомогою pop() ↓
// const mas = ['js', 'css', 'jq'] 
// const n = mas.length;

//     console.log(mas.pop());



// 3.3 Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 2, 3, 'a', 'b', 'c', 4, 5]. ↓
// const mas = [1, 2, 3, 4, 5];
// const tmp = [];

// tmp[1] = mas.pop();
// tmp[0] = mas.pop();

// mas.push('a','b','c',);

// mas.push(tmp[0]);
// mas.push(tmp[1]);

// for(let i=0; i<mas.length; i++)
// {
//     console.log(mas[i]);
// }



// 3.4 Дано масив [1, 2, 3, 4, 5]. Зробіть з нього масив [1, 'a', 'b', 2, 3, 4, 'c', 5, 'e']. ↓
// const mas = [1,2,3,4,5];

// const first = mas.shift();
// const last = mas.pop();

// mas.unshift(first,'a','b');
// mas.push('c',last,'e');

// for(let i=0; i<mas.length; i++)
// {
//     console.log(mas[i]);
// }


// 3.5 Взяти масив з 10 чисел або створити його. Вивести в консоль тільки ті елементи, значення яких є парними. ↓
// const mas = [5,7,2,4,12,9,6,4,2,8];

// for(let i=0; i<mas.length; i++)
// {
//     if(mas[i] % 2 == 0)
//     {
//         console.log(mas[i]);
//     }

// }



// 3.6 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. 
// За допомогою будь-якого циклу та push () скопіювати значення одного масиву в інший. ↓
// const mas1 = [5,7,2,4,12,9,6,4,2,8];
// const mas2 = [];

// for(let i=0; i<mas1.length; i++)
// {
//     let n = 0;
//     n = mas1[i];

//     mas2.push(n);
    
//     console.log(mas2[i]);

// }



// 3.7 Взяти масив з 10 чисел або створити його. Створити 2й порожній масив. 
// За допомогою будь-якого циклу скопіювати значення одного масиву в інший. ↓
// const mas1 = [5,7,2,4,12,9,6,4,2,8];
// const mas2 = [];

// for(let i=0; i<mas1.length; i++)
// {
//     let n=0;

//     n = mas1[i];
//     mas2[i] = n;
    
//     console.log(mas2[i]);

// }



// // ==========================================================================================
// зробити масив з 10 чисел [2,17,13,6,22,31,45,66,100,-18]та:
// 4.1 перебрати його циклом while
// 4.2 перебрати його циклом for
// 4.3 перебрати циклом while та вивести  числа тільки з непарним індексом
// 4.4 перебрати циклом for та вивести  числа тільки з непарним індексом
// 4.5 перебрати циклом while та вивести  числа тільки парні  значення
// 4.6 перебрати циклом for та вивести  числа тільки парні  значення
// 4.7 замінити кожне число кратне 3 на ваше імя
// 4.8 вивести масив в зворотньому порядку.
// 4.9 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)
// 4.10
//  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу.
// // ==========================================================================================

// 4.1 перебрати його циклом while ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=0;

// while(i < mas.length)
// {
//     console.log(mas[i]);
//     i++;
// }



// 4.2 перебрати його циклом for ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=0; i<mas.length; i++)
//     console.log(mas[i]);



// 4.3 перебрати циклом while та вивести  числа тільки з непарним індексом ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=0;

// while(i < mas.length)
// {
//     if(mas[i] % 2 != 0)
//     {
//         console.log(mas[i]);
//     }
    
//     i++;
// }




// 4.4 перебрати циклом for та вивести  числа тільки з непарним індексом ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=0; i<mas.length; i++)
// {
//     if(mas[i] % 2 != 0)
//     {
//         console.log(mas[i]);
//     }
// }



// 4.5 перебрати циклом while та вивести  числа тільки парні  значення ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=0;

// while(i < mas.length)
// {
//     if(mas[i] % 2 == 0)
//     {
//         console.log(mas[i]);
//     }
    
//     i++;
// }



// 4.6 перебрати циклом for та вивести  числа тільки парні  значення ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=0; i<mas.length; i++)
// {
//     if(mas[i] % 2 == 0)
//     {
//         console.log(mas[i]);
//     }
// }



// 4.7 замінити кожне число кратне 3 на ваше імя ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=0; i<mas.length; i++)
// {
//     if(mas[i] % 3 == 0)
//     {
//         console.log("Romasik");
//     }
// }





// 4.8 вивести масив в зворотньому порядку ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let n = mas.length;

// for(let i=n-1; i >= 0; i--)
// {
//     console.log(mas[i]);
// }
   

// 4.9 всі попередні завдання (окрім 8), але в зворотньому циклі (с заду на перед)

// 4.9(1) циклом while ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=mas.length-1;

// while(i >= 0)
// {
//     console.log(mas[i]);
//     i--;
// }


//===============================
//  ALL "4.x" TASKS IN REVERSE ↓
//===============================
// 4.9(1) циклом while ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=mas.length-1;

// while(i >= 0)
// {
//     console.log(mas[i]);
//     i--;
// }



// 4.9(2) перебрати циклом for ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let n = mas.length;

// for(let i=n-1; i >= 0; i--)
// {
//     console.log(mas[i]);
// }
   


// 4.9(3) перебрати циклом while та вивести числа тільки з непарним індексом ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=mas.length-1;;

// while(i >= 0)
// {
//     if(mas[i] % 2 != 0)
//     {
//         console.log(mas[i]);
//     }
    
//     i--;
// }



// 4.9(4) перебрати циклом for та вивести  числа тільки з непарним індексом ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=mas.length-1; i >= 0; i--)
// {
//     if(mas[i] % 2 != 0)
//     {
//         console.log(mas[i]);
//     }
// }




// 4.9(5) перебрати циклом while та вивести  числа тільки парні  значення ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];
// let i=mas.length-1;

// while(i >= 0)
// {
//     if(mas[i] % 2 == 0)
//     {
//         console.log(mas[i]);
//     }
    
//     i--;
// }



// 4.9(6) перебрати циклом for та вивести  числа тільки парні  значення ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=mas.length-1; i>=0; i--)
// {
//     if(mas[i] % 2 == 0)
//     {
//         console.log(mas[i]);
//     }
// }




// 4.9(7) замінити кожне число кратне 3 на ваше імя ↓
// const mas = [2,17,13,6,22,31,45,66,100,-18];

// for(let i=mas.length; i>=0; i--)
// {
//     if(mas[i] % 3 == 0)
//     {
//         console.log("Romasik");
//     }
// }



// 4.10  створити пустий масив та :
// - заповнити його 50 парними числами за допомоги циклу.
// - заповнити його 50 непарними числами за допомоги циклу. ↓
// const mas1 = [], mas2 = [];
// let digit=1;

// for(let i=0; i<=50; i++)
// {
//     digit = Math.floor(Math.random() * 15);

//     if(digit % 2 == 0)
//     {
//         mas1[i] = digit;
//     }
//     else if(digit % 2 != 0)
//     {
//         mas2[i] = digit;
//     }
// }




// // ==========================================================================================
// 5.1. Створити пустий масив та :
//        a. Заповнити масив 20ма рандомними числами.
//        b. Заповнити масив 20ма рандомними чисалами в діапазоні від 8 до 732
//  5.2. Вивести за допомогою console.log кожен третій елемен
//  5.3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним.
//  5.4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив
//  5.5. Вивести кожен елемент масиву, сусід справа якого є парним
//   EXAMPLE: [ 1, 2, 3, 5, 7, 9, 56, 8, 67 ] -> Має бути виведено 1, 9, 56
//  5.6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек.
//  5.7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив.
//  5.8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив.
// // ==========================================================================================



// 5.1 (a) Створити пустий масив заповнити масив 20ма рандомними числами. ↓
// const mas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//     digit = Math.floor(Math.random() * 15);

//     mas[i] = digit
// }

// console.log(mas);



// 5.1 (b) Створити пустий масив заповнити масив 20ма рандомними числами. ↓
// const mas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = Math.floor(Math.random() * (732 - 8 + 1)) + 8;

//     mas[i] = digit
// }

// console.log(mas);



// 5.2. Вивести за допомогою console.log кожен третій елемент ↓
// const mas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = digit = Math.floor(Math.random() * 15);
//     mas[i] = digit

//     if((i+1) % 3 == 0)
//     {
//         console.log(mas[i]);
//     }
// }

// console.log("---------------------");
// console.log(mas);



// 5.3. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним. ↓
// const mas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = digit = Math.floor(Math.random() * 15);
//     mas[i] = digit

//     if((i+1) % 3 == 0 && mas[i] % 2 == 0 && mas[i] > 1)
//     {
//         console.log(mas[i]);
//     }
// }

// console.log("---------------------");
// console.log(mas);



//  5.4. Вивести за допомогою console.log кожен третій елемен тільки якщо цей елемент є парним та записати їх в новий масив ↓
// const mas = [];
// const newmas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = digit = Math.floor(Math.random() * 15);
//     mas[i] = digit

//     if((i+1) % 3 == 0 && mas[i] % 2 == 0 && mas[i] > 1)
//     {
//         newmas[i] = mas[i];
//         console.log(newmas[i])
//     }
// }

// console.log("---------------------");
// console.log(mas);


//  5.5. Вивести кожен елемент масиву, сусід справа якого є парним ↓
// const mas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = digit = Math.floor(Math.random() * 15);
//     mas[i] = digit
// }  

// for(let i=0; i<=20; i++)
// {
//     if(mas[i+1] % 2 == 0 && mas[i+1] > 1)
//     {
//         console.log(mas[i]);
//     }
// }  
// console.log("---------------------");
// console.log(mas);



//  5.6. Є масив з числами [100,250,50,168,120,345,188], Які характеризують вартість окремої покупки. Обрахувати середній чек ↓
// const mas = [100,250,50,168,120,345,188];
// let n = mas.length;

// let res=0;

// for(let i=0; i<n; i++)
// {
//     res += mas[i];
// }
//     console.log(res/n);



//  5.7. Створити масив з рандомними значеннями, помножити всі його елементи на 5 та перемістити їх в інший масив ↓
// const mas = [];
// const newmas = [];
// let digit=1;

// for(let i=0; i<=20; i++)
// {
//    digit = digit = Math.floor(Math.random() * 15);
//     mas[i] = digit
// }

// console.log(mas);

// for(let i=0; i<=20; i++)
// {    mas[i] = mas[i] * 5;
//     newmas[i] = mas[i]
// }    

// console.log("---------------------\nNew array: ");
// console.log(newmas);



//  5.8. Створити масив з будь якими значеннями (стрінги, числа, і тд...). пройтись по ньому, і якщо елемент є числом - додати його в інший масив ↓
// const mas = [2,8,"Hi",5,"Dohla rusnia",true,12,"Hello World",1337,"Hebron-courses",28,08,2004]
// const newmas = [];
// let n = mas.length;

// for(let i=0; i < n; i++)
// {
//     if( (typeof mas[i]) == 'number')
//     {
//         let k=0
//         newmas[i] = mas[i];
//         console.log(newmas[i]);
//     }

    
// }
